### 从摩尔斯电码说二进制
1. story
2. 想别人也肯定遇到过类似的问题
3. 摩尔斯码为何如此定义
  没有原因不把猫称为🐶  随意吗，并不是这么简单
4. 手语，用手和胳膊的动作组合表达词语中的单个字母、整个词及其基本概念的语言
由此可以看到，重要的是背后的信息，编码可以有多种（信息编码的方式）
eg: 干嘛呢？ 重要的不是汉字编码，而是背后的信息？他可能是「想你了」
计算机不能直接处理人类世界的编码，因为它不能模拟人类的眼睛、鼻子、嘴、手指来接受信息。（这也简介说明了写作的难度，把语音编码场景交流转换成文字编码）
sos 三点 三横 三点 泰坦尼克号
以上的关键是什么？


------你可以用 两个词，两个声音，两个符号，（实际上任何两种不同的东西）及其组合代表任何种类的信息。  
所以你能看到电脑仅用电路的开关两种状态，表示了现实世界的几乎所有信息，
声音视频 ...

### 什么是编程
编程（programming）就是告诉计算机要做什么。
为啥要学习语言
所有计算机在内部都使用二进制。不过大多数人都不擅长使用这种语言。
我们需要一种更简便的方法来告诉计算机要做什么。所以人们发明了编程语言。利用计算机编程语言，
我们可以先用一种自己能理解的方式写程序，然后再把它翻译成二进制供计算机使用。
### 第一个程序 hello world
